In [2]:
# q1. jeju 데이터를 로드해보세요. 컬럼이 한글이므로 적절한 처리가 필요

In [28]:
# file loading
import pandas as pd

file_path = 'C://Users//samsung//TIL//DS//numpy//jeju_problem//jeju.csv'

jeju = pd.read_csv(file_path, engine='python')

In [29]:
# q2. 데이터의 마지막 3개 행을 호출해보세요.

In [30]:
print(df_jeju.tail(3))

      Unnamed: 0     id          일자   시도명 읍면동명         거주인구       근무인구  \
9618        9618  32066  2020-04-30   제주시  도두동    28397.481   3144.895
9619        9619  32067  2020-04-30  서귀포시  안덕면   348037.846  29106.286
9620        9620  32068  2020-04-30   제주시   연동  1010643.372  65673.477

            방문인구       총 유동인구   평균 속도  평균 소요 시간  평균 기온  일강수량  평균 풍속
9618   84052.697   115595.073  41.053    29.421   20.3   0.0    3.0
9619  251129.660   628273.792  46.595    49.189   17.6   0.0    3.5
9620  447622.068  1523938.917  40.863    27.765   14.1   0.0    4.8

In [31]:
# q3. 범주형 변수를 가진 컬럼을 출력해보세요.

In [32]:
jeju.info()

jeju.select_dtypes('object').head()
# jeju.select_dtypes(include = 'object').columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9621 entries, 0 to 9620
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  9621 non-null   int64
 1   id          9621 non-null   int64
 2   일자          9621 non-null   object
 3   시도명         9621 non-null   object
 4   읍면동명        9621 non-null   object
 5   거주인구        9621 non-null   float64
 6   근무인구        9621 non-null   float64
 7   방문인구        9621 non-null   float64
 8   총 유동인구      9621 non-null   float64
 9   평균 속도       9621 non-null   float64
 10  평균 소요 시간    9621 non-null   float64
 11  평균 기온       9621 non-null   float64
 12  일강수량        9621 non-null   float64
 13  평균 풍속       9621 non-null   float64
dtypes: float64(9), int64(2), object(3)
memory usage: 1.0+ MB

           일자   시도명  읍면동명
0  2018-01-01   제주시   도두동
1  2018-01-01   제주시   외도동
2  2018-01-01   제주시  이도2동
3  2018-01-01   제주시  일도1동
4  2018-01-01  서귀포시   대천동

In [33]:
# q4. 숫자형 변수를 가진 컬럼을 출력해보세요.

In [34]:
jeju.select_dtypes('float64').head()
# jeju.select_dtypes(exclude = 'object').columns

,거주인구,근무인구,방문인구,총 유동인구,평균 속도,평균 소요 시간,평균 기온,일강수량,평균 풍속
0,32249.987,3418.266,102709.092,138377.345,39.556,29.167,5.0,0.0,2.5
1,213500.997,10341.172,112692.789,336534.958,32.900,30.900,5.0,0.0,2.5
2,1212382.218,96920.834,541194.481,1850497.533,29.538,35.692,2.9,0.0,2.4
3,33991.653,6034.253,72155.919,112181.825,30.000,23.500,2.9,0.0,2.4
4,155036.925,9403.969,150882.409,315323.303,41.583,14.375,5.1,0.0,2.3

In [35]:
# q5. 각 컬럼들의 결측치 숫자들을 파악해보세요.

In [36]:
jeju.isna().sum()

Unnamed: 0    0
id            0
일자            0
시도명           0
읍면동명          0
거주인구          0
근무인구          0
방문인구          0
총 유동인구        0
평균 속도         0
평균 소요 시간      0
평균 기온         0
일강수량          0
평균 풍속         0
dtype: int64

In [7]:
# q6. 각 컬럼의 데이터수, 데이터타입을 한 번에 확인해보세요.

In [23]:
jeju.id.value_counts()
jeju.일자.value_counts()

2020-03-21    21
2018-01-16    20
2019-10-15    20
2019-10-08    19
2020-03-13    19
              ..
2019-03-29     5
2018-11-13     5
2018-06-02     5
2019-08-15     4
2019-04-27     2
Name: 일자, Length: 803, dtype: int64

In [8]:
# q7. 거주인구, 근무인구와 방문인구, 총 유동인구로만 구성된 df를 만드세요.

In [51]:
cols = ['거주인구', '근무인구', '방문인구', '총 유동인구']

# df_jeju = pd.DataFrame(jeju, columns=cols)

df_jeju = jeju[cols]
df_jeju.head()

          거주인구       근무인구        방문인구       총 유동인구
0    32249.987   3418.266  102709.092   138377.345
1   213500.997  10341.172  112692.789   336534.958
2  1212382.218  96920.834  541194.481  1850497.533
3    33991.653   6034.253   72155.919   112181.825
4   155036.925   9403.969  150882.409   315323.303

In [ ]:
# q8 위에서 생성된 df에 행을 추가해주세요
# 추가 행값은 min값으로 해주세요.

In [49]:
print(df_jeju.min())
df_jeju.loc['min'] = df_jeju.min(axis=0)
df_jeju.tail(1)

거주인구       9305.552
근무인구       1407.936
방문인구      11538.322
총 유동인구    22251.810
dtype: float64

         거주인구      근무인구       방문인구    총 유동인구
min  9305.552  1407.936  11538.322  22251.81

In [11]:
# q9. 총 유동인구 컬럼의 값들을 출력해보세요.

In [43]:
df_jeju[['총 유동인구']]

           총 유동인구
0      138377.345
1      336534.958
2     1850497.533
3      112181.825
4      315323.303
...           ...
9616   397984.186
9617   735666.605
9618   115595.073
9619   628273.792
9620  1523938.917

[9621 rows x 1 columns]

In [10]:
# q10. 시도명의 유일값의 개수를 구해보세요.

In [52]:
jeju['시도명'].nunique()

# len(df_jeju['시도명'].value_countsts())

41